class PharaohDataAr {
  List<Map<String, String>> pharaooh = [
    {
      "image": "assets/images/قناع-الملك-توت-عنخ-آمون.jpg",
      "name": "الملك توت عنخ آمون",
      "namee": "King Tutankhamun",
      "details": ". توت عنخ آمون، الفرعون المصري، تولى الحكم على العرش في سن مبكرة، حوالي 9 سنوات، خلال السلالة الثامنة عشر. كانت فترة حكمه قصيرة، من حوالي 1332 إلى 1323 قبل الميلاد. وهو معروف بأفضل حالات الدفن المكتملة التي تم اكتشافها في وادي الملوك في عام 1922، والتي كانت مليئة بالكنوز والآثار، مما سلط الضوء على ثقافة وتاريخ مصر القديمة. وموته في سن مبكرة يظل لغزًا، مما أثار الاهتمام والتكهن لقرون ",
      "explore": " . توت عنخ آمون، المعروف غالبًا باسم الملك توت، حكم كفرعون لمصر من حوالي 1332 إلى 1323 قبل الميلاد خلال سلالة الثامنة عشر في المملكة الجديدة. على الرغم من أن فترة حكمه كانت قصيرة نسبيًا وتولى العرش في سن صغيرة جدًا، إلا أن إنجازاته والأهمية التاريخية لحكمه لا تزال ملحوظة. فيما يلي بعض الإنجازات والمساهمات الرئيسية لتوت عنخ آمون:\n\n"
          ". استعادة الدين: أحد أهم إنجازات توت عنخ آمون كانت استعادة الدين المصري التقليدي والممارسات التي تم تغييرها من قبل سلفه، أخناتون، الذي قام بتعزيز عبادة آتون، القرص الشمسي. تحت تأثير مستشاريه، قام توت عنخ آمون بإعادة تقديس الآلهة القديمة، وخاصة آمون، واستعادة الهياكل الدينية والكهنوت التي تعرضت للتدهور خلال إصلاحات أخناتون الواحدية.\n\n"
          ". نقل العاصمة: قام توت عنخ آمون بنقل العاصمة إلى طيبة من أختاتون (المعاصم الحديثة)، التي أسسها أخناتون. كان هذا التحرك جزءًا من الجهد الأوسع لاستعادة الترتيب الديني والثقافي التقليدي.\n\n"
          ". استعادة الاقتصاد: خلال حكم توت عنخ آمون، تم بذل جهود لاستقرار الاقتصاد، الذي عانى تحت حكم أخناتون. تم تخصيص الموارد لإصلاح وإعادة بناء الهياكل، بما في ذلك معابد كرنك والأقصر، مما ساهم في تنشيط الدين الدولة والاقتصاد\n\n"
          ". حملات عسكرية: على الرغم من أن هناك سجلات محدودة لإنجازات عسكرية بارزة، إلا أن بعض النقوش تشير إلى أن حكم توت عنخ آمون شهد بعض النشاط العسكري في شكل حملات للحفاظ على حدود مصر وتأثيرها، بشكل خاص في نوبيا والشام\n\n"
          ". ازدهار فني: شهد حكم توت عنخ آمون استمرارًا وتنقية للأساليب الفنية التي ميزت فترة أمرنا. قبره، الذي اكتشف في وادي الملوك في عام 1922 من قبل هوارد كارتر، هو شاهد على ثروة وفن فترته، حيث يحتوي على العديد من القطع الفنية الرفيعة المصنوعة، بما في ذلك قناعه الدفيني الذهبي البارز\n\n"
          ". بناء القبر: بناء قبر توت عنخ آمون (KV62) في وادي الملوك، على الرغم من صغره مقارنة بقبور الفراعنة الآخرين، إلا أنه أحد أفضل القبور المحفوظة والأكثر تأثيثًا تم اكتشافها. أسرارها قدمت رؤى لا تقدر بثمن في الثقافة المادية والحرفية والحياة اليومية في مصر القديمة\n\n"
          ". وفاة توت عنخ آمون في سن صغيرة (حوالي 18 أو 19 عامًا) واكتشاف قبره الشبه مكتمل في عام 1922 قد ساهما بشكل كبير في شهرته وفهم الحضارة المصرية القديمة. حكمه، على الرغم من كونه قصيرًا، لعب دورًا حاسمًا في الفترة الانتقالية لتاريخ مصر، بشكل خاص في استعادة الممارسات الدينية التقليدية التي استمرت لقرون"
    },
    {
      "image": "assets/images/amnthotb el talt (1).jpg", "name": "امنحتب الثالث",
      "namee": "King Amnthotb III",
      "details":"أمنحتب الثالث، المعروف أيضًا بأمنحتب العظيم، حكم مصر القديمة خلال السلالة الثامنة عشر من حوالي عام 1386 إلى 1353 قبل الميلاد. وكانت فترة حكمه مميزة بالازدهار والتنوع الثقافي والمشاريع البنائية الواسعة، بما في ذلك معبد الأقصر وتمثالا كولوسي الممنون. كان معروفًا ببراعته الدبلوماسية، حيث حافظ على العلاقات السلمية والتجارة مع الممالك المجاورة",
    "explore":": أمنحتب الثالث، المعروف أيضًا باسم أمنحتب العظيم، حكم مصر خلال السلالة الثامنة عشر (حوالي 1386–1353 قبل الميلاد) وحقق العديد من الإنجازات خلال فترة حكمه. فيما يلي بعض إنجازاته الملحوظة\n\n"
    ". مشاريع البناء: كان أمنحتب الثالث مشهورًا بمشاريعه البنائية الواسعة، بما في ذلك بناء وتجديد المعابد والقصور والمعالم في جميع أنحاء مصر. بنى أو قام بتوسيع المعابد في كرنك، والأقصر، وسولب، وغيرها. كان معبده الضريحي، المعروف باسم  الملايين من السنين، موجودًا على الضفة الغربية لنهر النيل في طيبة وكان أحد أكبر وأروع الهياكل في زمانه\n\n"
        ". الفن والثقافة: كان أمنحتب الثالث راعيًا للفنون وشهد فترة ازدهار فني وثقافي في مصر القديمة. قام بتكليف العديد من التماثيل والنقوش والأعمال الفنية الأخرى، كثير منها كان يصوره وعائلته بأشكال مثالية. تعتبر فترة حكمه عصرًا ذهبيًا للفن المصري\n\n"
        ". العلاقات الخارجية: حافظ أمنحتب الثالث على علاقات سلمية مع القوى الخارجية خلال فترة حكمه، مما ساهم في الاستقرار والازدهار داخل مصر. شارك في زيجات دبلوماسية مع أميرات خارجيات لتعزيز التحالفات، بما في ذلك زواجه من تيي، التي أصبحت واحدة من أكثر الملكات تأثيرًا في تاريخ مصر\n\n"
        ". الازدهار الاقتصادي: تحت حكم أمنحتب الثالث، عاشت مصر فترة ازدهار اقتصادي ووفرة. ازدهرت التجارة، مما جلب الثروة والسلع الغريبة من بلدان بعيدة، وازدهر القطاع الزراعي، مما أدى إلى زيادة إنتاج الغذاء والازدهار للسكان\n\n"
        ". لمساهمات الدينية: كان أمنحتب الثالث مشاركًا بشكل عميق في الحياة الدينية في مصر وكان راعيًا لبناء وتجديد المعابد المكرسة لآلهة مختلفة. كان متفانيًا بشكل خاص في الإله آمون-رع، الإله الرئيسي في الأساطير المصرية، وساهمت نشاطاته الدينية في قوة وتأثير كهنة آمون\n\n"
        ". التماثيل الهائلة: قام أمنحتب الثالث بتكليف العديد من التماثيل الهائلة لنفسه، بما في ذلك تمثالي كولوسي الممنون الشهيرين، اللذين كانا يقفان عند مدخل معبده الضريحي. كانت هذه التماثيل، التي نحتت من كتل ضخمة من الحجر، تهدف إلى عرض قوة الفرعون ومكانته الإلهية\n\n"
        ". الطول والاستقرار: كانت فترة حكم أمنحتب الثالث واحدة من أطول وأكثر الفترات استقرارًا في تاريخ مصر القديم، حيث استمرت لما\n\n"
    },
    
    
{
  "image": "assets/images/hatshbsot.jpg",
  "name": "الملكة حتشبسوت",
  "namee": "King Hatshbsot",
  "details": "حكمت حتشبسوت، واحدة من أشهر حكام مصر القديمة، كفرعونة من حوالي عام 1479 إلى 1458 قبل الميلاد خلال السلالة الثامنة عشر. ارتدت بشكل مشهور كفرعون ذكر لتؤكد سلطتها وشرعيتها، وأشرفت على مشاريع بناء طموحة مثل معبد حتشبسوت في دير البحري. خلال حكمها، عرفت مصر فترة من السلام والازدهار، وقامت برحلات تجارية واسعة إلى أرض بونت، مما زاد من ثروات المملكة وتبادل الثقافات.",
  "explore": "حققت حتشبسوت، واحدة من أبرز حكام مصر القديمة، العديد من الإنجازات خلال فترة حكمها كفرعونة (حوالي 1478–1458 قبل الميلاد). فيما يلي بعض من إنجازاتها الملحوظة:\n\n"
  ". أول فرعونة: ربما تكون حتشبسوت أشهرهن باعتبارها واحدة من القلائل اللواتي حكمن مصر القديمة كفراعنة. استلمت العرش بعد وفاة زوجها ثوتموس الثاني، وكانت ولاية أمر زوجها الابن ثوتموس الثالث، قبل أن تتولى في النهاية السلطات الفرعونية بشكل كامل.\n\n"
  ". مشاريع البناء: بدأت حتشبسوت مشاريع بناء طموحة في جميع أنحاء مصر، بما في ذلك بناء معابد ومعالم رائعة. أشهر هذه المشاريع هو معبدها الضريحي، دجيسر-دجيسيرو (\"مقدس الأقداس\")، الموجود في دير البحري بالقرب من طيبة. يُشتهر هذا المعبد بعمارته المبتكرة ونقوشه الرائعة.\n\n"
  ". التجارة والدبلوماسية: شهدت فترة حكم حتشبسوت توسيعًا لشبكات التجارة والعلاقات الدبلوماسية مع حضارات أخرى، بخاصة في شرق البحر المتوسط وأرض بونت (ربما في الصومال الحالي أو إريتريا). جلبت البعثات التجارية إلى بونت سلعًا غريبة مثل اللبان والأبنوس والعاج والحيوانات الحية.\n\n"
  ". المساهمات الدينية: لعبت حتشبسوت دورًا كبيرًا في الحياة الدينية في مصر، حيث دعمت عبادة الآلهة والآلهة التقليدية مع رفع مكانة بعض الآلهة الغير معروفة. أرتبطت نفسها بشكل وثيق بالإله آمون، مدعية نسبًا إلهيًا وتصوير نفسها كممثلة أرضية له.\n\n"
  ". الرعاية الثقافية: دعمت حتشبسوت الفن والأدب والثقافة خلال فترة حكمها، بتكليف تماثيل ونقوش وأعمال فنية أخرى احتفلت بإنجازاتها وأعادت إلى ذكراها.\n\n"
  ". الاستقرار والازدهار: تحت حكم حتشبسوت، عاشت مصر فترة من الاستقرار والازدهار، مع النمو الاقتصادي، وتوسيع التجارة، وازدهار الثقافة. يُذكر حكمها غالبًا كفترة من السلام والازدهار في تاريخ مصر القديم.\n\n"
  ". على الرغم من محاولات محو إرثها من قبل فراعنة لاحقين، بما في ذلك زوج ابنها ثوتموس الثالث، فإن إنجازات حتشبسوت استمرت عبر القرون. لا تزال واحد "
  },

    {"image": "assets/images/akhnton.jpg",
  "name": "الملك أخناتون",
  "namee": "King Akhenaten",
  "details": "أخناتون، المعروف بإصلاحاته الدينية الثورية، حكم مصر القديمة خلال السلالة الثامنة عشر من حوالي عام 1353 إلى 1336 قبل الميلاد. قدم عبادة واحدة متمركزة حول إله الشمس آتون، مغيرًا عن الوثنية التقليدية. عاصمته، أخت أتون (اليوم أمارنا الحديثة)، تعكس الفكر الديني الجديد له. على الرغم من الازدهار الأولي، واجهت فترة حكمه معارضة، وبعد وفاته، تم عكس إصلاحاته بشكل كبير، وتم تفكيك معالمه.",
      "explore" : ": أخناتون، المعروف أيضًا باسم أمنحتب الرابع، هو أحد أشهر وأكثر فراعنة مصر القديمة إثارةً وجدلًا، ومعروف في المقام الأول بإصلاحاته الدينية والتغييرات الجذرية في النمط الفني. فيما يلي بعض من إنجازاته الملحوظة\n\n"
      ". الثورة الدينية: يُعتبر أخناتون الأكثر شهرة بسبب ثورته الدينية، التي تضمنت ترقية إله الشمس آتون إلى مكانة الإله العليا وقمع الوثنية المصرية التقليدية. أعلن آتون كإله واحد حقيقي وبدأ طقوسًا واحدة متمركزة حول عبادة القرص الشمسي. وقد مثل هذا تحولًا كبيرًا عن المعتقدات الوثنية التقليدية لمصر القديمة\n\n"
          ".  إنشاء أخت أتون: أسس أخناتون عاصمة جديدة تدعى أخت أتون (اليوم أمارنا) مخصصة لعبادة آتون. تم بناء المدينة من الصفر وكانت تعمل كمركز إداري وديني لمصر خلال فترة حكم أخناتون. تميزت بمعابد وقصور رائعة، تعكس القيم الدينية والفنية الجديدة لطائفة آتون\n\n"
          ". الابتكارات الفنية: شهد عهد أخناتون ثورة في الأسلوب الفني المعروف باسم \"فن العمارنة\". وقد انحرف هذا الأسلوب الفني عن الأعراف الفنية المصرية التقليدية، حيث صور الفرعون وعائلته بطريقة أكثر طبيعية وحميمية. وشدد على الواقعية، مع أبعاد ممتدة، وملامح مبالغ فيها، والتركيز على الأنشطة اليومية للعائلة المالكة.\n\n"
          ".  العائلة المالكة: لعبت عائلة أخناتون دورا بارزا في إصلاحاته الدينية والابتكارات الفنية. كانت زوجته، نفرتيتي، ملكة قوية ومؤثرة تلعب دورا مركزيا في عبادة آتون. كانت بناتهم، خصوصا الشهيرة عنخسنامون، أيضا شخصيات بارزة في محكمة أخناتون.\n\n"
          ". الدبلوماسية والسياسة الخارجية: شهد عهد أخناتون تحولا في السياسة الخارجية لمصر، حيث ركز على الدبلوماسية والسلام بدلا من الفتوحات العسكرية. سعى إلى الحفاظ على علاقات سلمية مع القوى المجاورة وشارك في المراسلات الدبلوماسية مع حكام آخرين، بما في ذلك تلك في إمبراطورية الحثيين\n\n"
          ".  المساهمات الأدبية: يُعتبر أخناتون مؤلفًا لسلسلة من الأناشيد والصلوات المكرسة لآتون، العظمى لآتون. تُمدح هذه النصوص إله الشمس وتعبر عن تفاني أخناتون في آتون ودوره كوسيط بين آتون والبشرية \n\n "
          ". التراث والجدل: على الرغم من إنجازاته الكبيرة، إلا أن عهده لأخناتون انتهى في جدل، وتم تفكيك إصلاحاته الدينية بشكل كبير من قبل خلفائه. ومع ذلك، يمثل عهده فترة مثيرة للتجربة والابتكار في تاريخ مصر القديم، مما ترك أثرا دائما على الفن والدين والثقافة في وادي النيل"},

   {"image": "assets/images/sonsrt3.jpg", "name": "سينوسرت الثالث",
   "namee": "King Sonsrt III",
     "details":"سينوسرت الثالث، فرعون من الأسرة الثانية عشرة في عصر الإمبراطورية الوسطى، حكم مصر القديمة من حوالي 1878 إلى 1839 قبل الميلاد. يحتفى به لحملاته العسكرية التي قام بها، حيث قام بتوسيع حدود مصر وتأمين أراضيها. بدأ سينوسرت الثالث العديد من المشاريع الإنشائية، بما في ذلك معبد الكنيسة الشهير في كارناك. يعتبر حكمه فترة من الاستقرار والازدهار، ويعتبر ذلك ذروة حضارة مصر المصرية.",
     "explore":":سينوسرت الثالث، المعروف أيضًا باسم سيسوستريس الثالث، كان فرعونًا قويًا في عصر الإمبراطورية الوسطى في مصر القديمة الذي حكم خلال الأسرة الثانية عشرة (حوالي 1878–1839 قبل الميلاد). يُعتبر غالبًا واحدًا من أكثر الحكام قدرة ونجاحًا في تاريخ مصر القديمة. فيما يلي بعض إنجازاته الملحوظة\n\n"
     ". الحملات العسكرية: قاد سينوسرت الثالث العديد من الحملات العسكرية لتوسيع أراضي مصر وضمان السيطرة على حدودها. خاض حملات ناجحة ضد نوبيا (إلى الجنوب) والمشرق الأدنى (إلى الشمال الشرقي) وليبيا (إلى الغرب)، مما ضمن هيمنة مصر في المنطقة.\n\n"
         ". مشاريع التحصين: قام سينوسرت الثالث بمشاريع تحصين واسعة النطاق على حدود مصر لحماية المملكة من التهديدات الخارجية. بنى سلسلة من الحصون والقلاع والمواقع العسكرية على نقاط استراتيجية على نهر النيل وفي مناطق رئيسية مثل شبه جزيرة سيناء وسفلى نوبيا.\n\n"
         ". تطوير البنية التحتية: بدأ سينوسرت الثالث مشاريع بنية تحتية هامة تهدف إلى تحسين أنظمة النقل والاتصال والري في مصر. بنى أو حدث قنوات وسدودًا وممرات مائية للسيطرة على الفيضانات السنوية لنهر النيل وضمان الازدهار الزراعي\n\n"
         ". الهندسة المعمارية الضخمة: قام سينوسرت الثالث بتكليف عدة مشاريع معمارية رائعة، بما في ذلك المعابد والقصور والتماثيل المخصصة لل\n\n"
         ". الإصلاحات الإدارية: قام سينوسرت الثالث بتنفيذ إصلاحات إدارية تهدف إلى تمركز السلطة الملكية وتعزيز الجهاز البيروقراطي للدولة المصرية. عين مسؤولين موثوق بهم في المناصب الإدارية الرئيسية وأنشأ أنظمة للضرائب وإنفاذ القانون وإدارة الأراضي.\n\n"
         ". دعم الحضارة: كان سينوسرت الثالث راعيًا للفنون والأدب، حيث دعم إنتاج النصوص الدينية والترانيم والأعمال الأدبية التي احتفت بإنجازاته ومجدت الآلهة. شهدت فترة حكمه ازدهارًا في النشاط الفكري والفني، حيث قام العلماء والحرفيون بإنتاج أعمال ذات جودة وجمال استثنائيين.\n\n"
         ". طول العمر والاستقرار: كانت فترة حكم سينوسرت الثالث مميزة بالاستقرار والازدهار والسلام النسبي، مما سمح لمصر بالازدهار اقتصاديًا وثقافيًا. ساهمت حكمه الفعال وبارعته العسكرية في طول عمر الأسرة الثانية عشرة وضمان إرثه باعتباره أحد أنجح الفراعنة في تاريخ مصر القديمة."},

    {"image": "assets/images/sonsrt1.jpg", "name": "سينوسرت الاول",
    "namee": "King Sonsrt I",
        "details":"سينوسرت الأول، فرعون من الأسرة الثانية عشرة في عصر الإمبراطورية الوسطى، حكم مصر القديمة من حوالي 1971 إلى 1926 قبل الميلاد. اشتهر بحملاته العسكرية، بشكل لافت ضد النوبيين، وتوسيع إقليم مصر وتأثيرها. إشراف سينوسرت الأول على العديد من المشاريع الإنشائية، بما في ذلك الكنيسة البيضاء الشهيرة وهرم اللاهون. يتذكر حكمه كفترة ازدهار وازدهار ثقافي، مما يشكل أحد أوجه العصور الوسطى",
      "explore":": سنوسرت الأول، المعروف أيضًا باسم سنوسرت الأول، كان فرعونًا مهمًا من الأسرة الثانية عشر في مصر القديمة في المملكة الوسطى، حكم من حوالي عام 1971 إلى عام 1926 قبل الميلاد. غالبًا ما يُنظر إليه على أنه أحد أكثر الحكام قدرة وتأثيرًا في سلالته. وفيما يلي بعض من إنجازاته البارزة\n\n"
      ". مشاريع البناء: بدأ سنوسرت الأول العديد من مشاريع البناء الطموحة في جميع أنحاء مصر، بما في ذلك بناء وتجديد المعابد والقصور والآثار. وقام ببناء معابد مخصصة لمختلف الآلهة والإلهات، مثل معبد آمون بالكرنك ومعبد الكرنك. من مونتو في تود\n\n"
          "التوسع في الري: يعود الفضل إلى سنوسرت الأول في توسيع أنظمة الري في مصر، وخاصة في منطقة الفيوم. فقد أمر ببناء القنوات والممرات المائية لتحسين الإنتاجية الزراعية وزيادة الأراضي الصالحة للزراعة المتاحة للزراعة، مما أدى إلى الرخاء الاقتصادي\n\n"
          "الحملات العسكرية: قام سنوسرت الأول بحملات عسكرية ناجحة للدفاع عن حدود مصر وتوسيع أراضيها، وشن حملات ضد النوبيين في الجنوب والليبيين في الغرب، مما أدى إلى تأمين هيمنة مصر على هذه المناطق وضمان الاستقرار على طول الحدود\n\n"
          "التماثيل الضخمة: أمر سنوسرت الأول بإنشاء العديد من التماثيل والنقوش التي تصور نفسه في أوضاع مختلفة وشعارات ملكية. لم تكن هذه التماثيل تخدم فقط لتمجيد الملك ولكن أيضًا لنشر الأيديولوجية الملكية وتأكيد ملكيته الإلهية للشعب المصري\n\n"
          "الرعاية الثقافية: كان سنوسرت الأول راعيًا للفنون والآداب، ودعم إنتاج النصوص الدينية والأناشيد والأعمال الأدبية التي احتفت بإنجازات الفرعون وتمجيد فضائل الآلهة. وشهد عهده ازدهارًا النشاط الفكري والفني، حيث يقوم العلماء والحرفيون بإنتاج أعمال ذات جودة استثنائية\n\n"
          "تعزيز السلطة المركزية: نفذ سنوسرت الأول إصلاحات إدارية تهدف إلى مركزة السلطة الملكية وتعزيز الجهاز البيروقراطي للدولة المصرية. وقام بتعيين مسؤولين موثوقين في مناصب إدارية رئيسية وأنشأ أنظمة للضرائب وإنفاذ القانون وإدارة الأراضي\n\n"
          "الإرث والخلافة: كان عهد سنوسرت الأول بمثابة فترة من الاستقرار والازدهار في مصر القديمة، ووضع الأساس للمجد اللاحق للأسرة الثانية عشرة. وقد ضمن حكمه الفعال وبراعته العسكرية إرثه كواحد من أكثر إرث مصر نجاحًا واحترامًا. الفراعنة، وقد كرمته الأجيال اللاحقة لإنجازاته ومساهماته في المملكة"},

    {"image": "assets/images/to7tmos.jpg", "name": "تحتمس الثالث",
    "namee": "King Tahtmos III",
      "details":"تحتمس الثالث، الذي يشار إليه غالبًا باسم نابليون مصر، حكم خلال الأسرة الثامنة عشرة للمملكة الحديثة، من حوالي 1479 إلى 1425 قبل الميلاد. وقام بتوسيع الإمبراطورية المصرية من خلال العديد من الحملات العسكرية، بما في ذلك معركة مجدو الشهيرة. نفذ تحتمس الثالث إصلاحات إدارية وشجع التجارة، مما أدى إلى فترة من الازدهار والتقدم الثقافي عرفت باسم عصر النهضة تحتمس. عزز عهده مكانة مصر كقوة مهيمنة في الشرق الأدنى القديم",
    "explore":":كان تحتمس الثالث، الذي يشار إليه غالبًا باسم نابليون مصر، أحد أنجح الفراعنة المحاربين في مصر القديمة، حيث حكم من حوالي 1479 إلى 1425 قبل الميلاد خلال فترة المملكة الحديثة. وإنجازاته عديدة وهامة، والتي شكلت مسار التاريخ المصري. وفيما يلي بعض من إنجازاته البارزة\n\n"
    " الحملات العسكرية والتوسع: أجرى تحتمس الثالث العديد من الحملات العسكرية لتوسيع حدود مصر وتثبيت هيمنته في الشرق الأدنى القديم. قاد ما لا يقل عن 17 حملة عسكرية في سوريا وكنعان والنوبة، ووسع الأراضي المصرية إلى أقصى حد\n\n"
        "معركة مجدو: أشهر انتصار عسكري لتحتمس الثالث حدث في معركة مجدو، حيث هزم تحالفًا من الكنعانيين وقوى إقليمية أخرى. يعد هذا النصر الحاسم من أقدم المعارك المسجلة في التاريخ، وقد عزز سيطرة مصر على بلاد الشام.\n\n"
        ". الإصلاحات الإدارية: نفذ تحتمس الثالث إصلاحات إدارية تهدف إلى مركزية السلطة الملكية وتبسيط البيروقراطية. وقام بتعيين مسؤولين موثوقين في مناصب إدارية رئيسية وأنشأ أنظمة للضرائب وإنفاذ القانون وإدارة الأراضي.\n\n"
        "مشاريع البناء الضخمة: نفذ تحتمس الثالث مشاريع بناء واسعة النطاق، بما في ذلك بناء وتجديد المعابد والقصور والآثار في جميع أنحاء مصر. وتشمل الأمثلة البارزة توسعة مجمع معبد الكرنك وبناء قاعة المهرجانات في الكرنك.\n\n"
        "الرعاية الثقافية: كان تحتمس الثالث راعيًا للفنون والآداب، ودعم إنتاج النصوص الدينية والتراتيل والأعمال الفنية التي احتفلت بانتصاراته العسكرية وتمجد الآلهة. قام بتكليف تماثيل ونقوش تصور نفسه في أوضاع مختلفة وشعارات ملكية.\n\n"
        "الدبلوماسية والتجارة: انخرط تحتمس الثالث في الدبلوماسية والتجارة مع القوى الأجنبية، وأقام تحالفات وأقام علاقات تجارية مع الممالك المجاورة. تفاوض على المعاهدات وتحالفات الزواج لتأمين السلام وتعزيز مكانة مصر في المنطقة.\n\n"
        "ترميم المعابد: قام تحتمس الثالث بترميم وتجديد العديد من المعابد في جميع أنحاء مصر، وخصص الموارد لصيانة وصيانة الهياكل الدينية. كما أمر ببناء معابد ومعالم جديدة لتكريم الآلهة وإحياء ذكرى انتصاراته العسكرية.\n\n"
        "طول العمر والاستقرار: كان عهد تحتمس الثالث بمثابة فترة من الاستقرار والازدهار في مصر القديمة، والمعروفة باسم 'العصر الذهبي' للمملكة الحديثة. ساهمت فتوحاته العسكرية وإصلاحاته الإدارية في ثروة مصر وقوتها، مما ضمن إرثه كواحد من أعظم فراعنة مصر."},
         {
      "image": "assets/images/exi/masala.jpg",
      "name": "المسلة المعلقة للملك رمسيس الثاني",
      "namee": "The Hanging Obelisk of King Ramesses II",
      "details": "و الأن سوف نتحدث عن هذا الأثر المثير هذه المسلة تم اكتشافها في مكان اسمه صهر الحجر ف الشرقيه حاليا مقسمة إلى عدة أجزاء وهى منحوتة من حجر الجرانيت الوردي وتتميز بجمال نقوشها التى تصور الملك رمسيس الثانى، واقفا أمام أحد المعبودات، بالإضافة إلى الألقاب المختلفة له",
       
    },

    {
       "image": "assets/images/exi/tahtmos.jpg",
      "name": "تمثال للملك تحتمس الثالث",
      "namee": "Thutmose III",
      "details": "--عندما تولى الملك تحتمس الثالث حكم البلاد، قضى الاثنين والعشرين عاما الأولى من عهده في شراكة على العرش مع عمته وزوجة أبيه الملكة حتشبسوت، وذلك قبل أن يتولى الحكم منفردا. وفي هذا التمثال يظهر الملك تحتمس الثالث جالسا على العرش، وهو يضع قدميه الحافيتين على قاعدة صورت عليها الأقواس التسعة؛ التي كانت ترمز إلى جميع أعداء مصر، والتي يطؤها الملك بقدميه، وقد صارت خاضعة له."
         
       
    },
     {
      "image": "assets/images/exi/3mod.jpg",
      "name": "عمود النصر للملك مرنبتاح",
      "namee": "victory column of king merenptah",
      "details": "-بعد وفاة الملك رمسيس الثاني, خلفه على العرش ابنه الملك مرنبتاح, و الذي خاض الحروب في مواجهة أعداء البلاد; من القبائل الليبية و شعوب البحر. و سجلت أخبارتلك الحروب علي اللوحات و الأعمدة المنقوشة, و التي كانت تسمي:(كتابات للأبدية).",
       
    },
     {
      "image": "assets/images/sonsrt1.jpg",
      "name": "سونسرت الاول",
      "namee": "sunesurt I",
      "details": "-هذا التمثال هو للملك سونسرت الاول لمعروف أيضًا باسم سيسي إنه فرعون مهم في تاريخ مصر القديمة وله تأثير كبير على الحضارة المصرية و سوف يكون له اهمية كبيرة يسردها لنا الان.",
       
    },
     {
      "image": "assets/images/exi/ramses.jpg",
      "name": "رمسيس الثاني",
      "namee": "Rameses II",
      "details": "-يظهر هذا التمثال الضخم مدى قوة وثراء صاحبه الملك رمسيس الثاني، وكان هذا التمثال في الأصل قائما خارج المعبد الرئيس للمعبود بتاح بمدينة منف العاصمة القديمة للبلاد، حيث كان الغرض من تمثيل الملك بتلك الهيئة المهيبة أن يجعل رمسيس كحارس لحرم ذلك المعبد المقدس و سوف نرا تاريخ هذا الملك العريق في هيأته عنما يتحث الأن.",
       
    },
     {
     "image": "assets/images/exi/colo.jpg",
      "name": "تمثال لملك من الدولي الوسطي",
      "namee": "colossal statue of a Middle kingdom king",
      "details": "-يصور هذا التمثال أحد الملكين ; سنوسرت الثالث, او أمنمحات الرابع. و تظهر أميرتان علي جانب أرجل التمثال. و ليس مؤكدا لدينا حتي الأن, ان كان الملك أمنمحات الرابع لديه أطفال. أما الملك سنوسرت الثالث فكان له ثلاث زوجات, و خمس بنات.",
       
    },
    
     {
      "image": "assets/images/sonsrt3.jpg",
      "name": "سونسرت الثالث",
      "namee": "senusret III",
      "details": "--كان من خامس فراعنة الأسرة الثانية عشر, ويعتبر من أعظم فراعنة الدولة الوسطى. وسماه الإغريق سيزوستريس الثالث و الكثير من الحكايات سوف يتحث بها عن نفسه الأن.",
       
    },


      {
     "image":"assets/images/exi/abo.jpg",
      "name": "تمثال ابو الهول للملك امنمحات الثالث",
      "namee": "The Sphinx of King Amenemhat III",
      "details": "--يعتبر تمثال أبي الهول اندماجا لقوة الأسد و قوة الملك في أن واحد. و يعد هذا التمثال واحدا من سبعة تماثيل لأبي الهول للملك أمنمحات الثالث، والتي عثر عليها في تانيس بالدلتا. وتتشابه ملامح تلك التماثيل السبعة بملامح الملك، حيث تظهر الملك بوجه ممتلئ وشفاه عريضة.",
       
    },
      {
      "image": "assets/images/exi/abo2.jpg",
      "name": "تمثال ابي الهول بأسماء الملكين رمسيس الثاني و مرنبتاح",
      "namee": "The Sphinx statue with the names of the kings Ramesses II and Merneptah",
      "details":"-التمثال يصور أبو الهول بجسم أسد ورأس ملك، وهو نموذج شهير للفن المصري القديم الذي يعبر عن القوة الملكية والإلهية. التمثال منحوت من الحجر الجيري، وهو نفس المادة المستخدمة في تمثال أبو الهول الأكبر في الجيزة يعكس التمثال أهمية أبو الهول في الحضارة المصرية القديمة كرمز للحماية والقوة الملكية." ,
       
    },
      {
      "image": "assets/images/exi/32.jpg",
      "name": "تمثال الملك رمسيس الثاني مع المعبود بتاح تاتنن" ,
      "namee": "Statue of King Ramesses II with the deity Ptah Tatenen",
      "details": "--إله الخلق والصناعة: بتاح تاتنن كان يُعبد في مصر القديمة كإله للخلق والصناعة والحرف. كان بتاح يعتبر من الآلهة الرئيسية في مدينة ممفيس، المركز الديني والإداري في مصر القديمة. كان بتاح يُعتبر صانع الآلهة والبشر، ويُقال إنه خلق العالم من خلال نطق الكلمات المقدسة.",
       
    },
     {
      "image": "assets/images/exi/hat.jpg",
      "name":"تاج عمود حتحوري" ,
      "namee": "Hathorian column capital",
      "details": "-كانت هذه القطعة تمثل تاجا لأحد الأعمدة ذات الطراز الحتحوري، حيث تصور في كانت هذه القطعة تمثل تاجا لأحد الأعمدة ذات الطراز عبودة حتحور بوجه آدمي إحدى الأدوات الموسيقية المعروفة باسم الصلاصل حية الكوبرا، ويماثل الشكل الكامل من هذه الأعمدة وأذني بقرة، وتعلو رأسها مقصورة صغيرة، تحتوي على الأسرة الثلاثين أو بداية العصر البطلمي والتي كانت تحملها السيدات وتعزف عليها بهزها بيديها في الطقوس الدينية وربما يرجع هذا التاج إلى أحد المعابد المفقودة بمدينة منديس.",
       
    },
     {
      "image": "assets/images/exi/22.jpg",
      "name":"تمثال الملك رمسيس الثاني مع المعبودة عنات" ,
      "namee": "Statue of King Ramesses II with the goddess Anat",
      "details": "--عنات كانت تُعبد كإلهة للحرب والخصوبة في الميثولوجيا الكنعانية والمصرية القديمة تُصور عادة كامرأة تحمل سيفًا أو رمحًا وترتدي تاجًا به ريش.لعبت دورًا مهمًا في تعزيز مفهوم القوة والحماية لدى الملوك والمحاربين في الثقافات القديمة.",
       
    },
     {
      "image": "assets/images/exi/rams2.jpg",
      "name":"تمثال للملك رمسيس الثاني في حماية احدي المعبودات",
      "namee": "A statue of King Ramesses II protecting a deity",
      "details": "-هو ابن الفرعون سيتي الأول والملكة تويا، وكان يُلقّب بالحاكم الشريك لوالدِه. رافقَ والده أثناء حملاته العسكرية على النوبة وبلاد الشام وليبيا وهو في عمر الرابعة عشر. وخلال فترة حكمه، قاد رمسيس الثاني عدة حملات عسكرية إلى بلاد الشام وبني عددا ضخما من المعابد والتماثيل، أشهرها معبد أبو سمبل في محافظة أسوان، جنوبي البلاد. كما بني الفرعون المصري عددا كبيرا من المسلات،",
       
    },
     {
      "image": "assets/images/exi/oz.jpg",
      "name": "تمثال اوزوريس" ,
      "namee": "Statue of Osiris",
      "details": "-أوزوريس هو إله الحياة الآخرة، والعالم السفلي، والموتى في الأساطير المصرية القديمة. يرتبط أيضًا بالبعث والحياة بعد الموت والخصوبة. يعتبر أوزوريس واحدًا من أهم الآلهة في البانثيون المصري، وهو محور الأساطير المتعلقة بالموت والحياة الآخرة.تماثيل أوزوريس كانت توضع عادة في المعابد والمقابر والأماكن المقدسة الأخرى لتكريم الإله واستدعاء حمايته وبركاته للحياة الآخرة. كانت تخدم وظيفة دينية وحامية، لضمان تحقيق المتوفى للحياة الأبدية.",
       
    },
     {
      "image": "assets/images/exi/3.jpg",
      "name":"تمثال المعبود بتاح و الملك رمسيس الثاني مع المعبودة سخمت",
      "namee": "Statue of the god Ptah and King Ramesses II with the goddess Sekhmet",
      "details": "--هو ابن الفرعون سيتي الأول والملكة تويا، وكان يُلقّب بالحاكم الشريك لوالدِه. رافقَ والده أثناء حملاته العسكرية على النوبة وبلاد الشام وليبيا وهو في عمر الرابعة عشر. وخلال فترة حكمه، قاد رمسيس الثاني عدة حملات عسكرية إلى بلاد الشام وبني عددا ضخما من المعابد والتماثيل سخمت كانت إلهة الحرب والدمار ولكن أيضًا الشفاء والحماية في مصر القديمة. سخمت كانت تعتبر حامية الفرعون وتلعب دورًا مهمًا في الطقوس المتعلقة بالحرب. بتاح كان يُعبد في مصر القديمة خاصة في مدينة منف (ممفيس) ويعتبر إله الخلق، الصناعة والفنون. و يُعتبر رمزًا للحكمة والبراعة في الصناعة.",
       
    },
    {
      "image": "assets/images/exi/big.jpg",
      "name":"تمثال ضخم للمعبود بتاح" ,
      "namee": "A huge statue of the god Ptah",
      "details": "-تمثال المعبود بتاح يمثل إله الخلق والصناعة والفنون في مصر القديمة. كان يُعبد بشكل رئيسي في مدينة منف (ممفيس) ويُصور كرجل ملفوف في شريط ضيق مع صولجان يجمع رموز الحياة والاستقرار والقوة. التماثيل تُصنع عادة من الحجر أو المعدن وتتميز بتفاصيل دقيقة. يُعتبر التمثال رمزًا مهمًا يعكس براعة المصريين في النحت وأهمية بتاح في الديانة المصرية.",
       
    },
    {"image": "assets/images/exi/2.jpg",
      "name":"تمثال مزدوج للملك امنحتب الثالث مع المعبودة رع حور اختي" ,
      "namee": "A double statue of King Amenhotep III with the goddess Ra Hor-akheti",
      "details": "--يجلس الملك أمنحتب الثالث في هذا التمثال بجوار معبود الشمس رع حور آختي الممثل برأس صقر ويتميز هذا التمثال بأنه منحوت من قطعه فريده من حجر الجرانيت الملون اللذي يجمع بين اللونين الاحمر كالشمس والاسود مثل الارضيه الخصبه وتشير ملامح الملك بعينه الضيقتين وفمه اللذي يظهر بشكل طبيعي الي ان هذا التمثال ربما يرجع الي نهاية العام الثامن والثلاثين من عهد الملك امنحتب الثالث",
       
    },
  ];

 
 

  String getImage(int index) {
    return pharaooh[index]['image']!;
  }

  String getName(int index) {
    return pharaooh[index]['name']!;
  }
  String getDetails(int index) {
    return pharaooh[index]['details']!;
  }
  String getExplore(int index) {
    return pharaooh[index]['explore']!;
  }
  String getNamee(int index) {
    return pharaooh[index]['namee']!;
  }
}